-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Апр 15 2021 г., 09:48
-- Версия сервера: 5.6.47
-- Версия PHP: 7.4.5

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `u28496_tools`
--

-- --------------------------------------------------------

--
-- Структура таблицы `customers`
--

CREATE TABLE `customers` (
  `id` int(10) NOT NULL,
  `name` varchar(50) DEFAULT NULL,
  `phone` varchar(15) DEFAULT NULL,
  `mailindex` varchar(20) DEFAULT NULL,
  `city` varchar(30) DEFAULT NULL,
  `adress` varchar(30) DEFAULT NULL,
  `comments` varchar(200) DEFAULT NULL,
  `data` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `status` varchar(50) DEFAULT 'New',
  `orders_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `items`
--

CREATE TABLE `items` (
  `id` int(10) UNSIGNED NOT NULL,
  `vendor` int(10) UNSIGNED DEFAULT NULL,
  `maingroup_id` varchar(200) DEFAULT NULL,
  `subgroup_id` varchar(200) DEFAULT NULL,
  `item` varchar(200) DEFAULT NULL,
  `price` float UNSIGNED DEFAULT NULL,
  `pur_price` float UNSIGNED DEFAULT NULL,
  `description` text,
  `old_price` int(11) DEFAULT NULL,
  `top_product` tinyint(4) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `items`
--

INSERT INTO `items` (`id`, `vendor`, `maingroup_id`, `subgroup_id`, `item`, `price`, `pur_price`, `description`, `old_price`, `top_product`) VALUES
(1, 63153, '1', '1', 'Автоклав-стерилизатор \"Домашний погребок\" 2 в 1 \"Аромат\" 22л для самогоноварения', 14429, 11099, '', NULL, 0),
(2, 49607, '1', '1', 'Автоклав-стерилизатор \"Домашний погребок\" 2 в 1 22л с надстройкой \"Классик\" для самогоноварения', 13779, 10599, '', NULL, 0),
(3, 49606, '1', '1', 'Автоклав-стерилизатор \"Домашний погребок\" 22л нерж, маном., терм., клап. сброса изб. давл.', 11049, 8499, '', NULL, 0),
(4, 49604, '1', '1', 'Автоклав-стерилизатор \"Консерватор\" 14л нерж., маном., терм., клап. сброса изб. давл.', 8457, 6505, '', NULL, 0),
(5, 63152, '1', '1', 'Автоклав-стерилизатор \"Консерватор\" 2 в 1 14л \"Аромат\" для самогоноварения', 11764, 9049, '', NULL, 0),
(6, 49605, '1', '1', 'Автоклав-стерилизатор \"Консерватор\" 2 в 1 14л с надстройкой \"Классик\" для самогоноварения', 10474, 8057, '', NULL, 0),
(7, 49612, '2', '2', 'Автополив для цветов М2150 (40)', 59, 45, '', NULL, 0),
(8, 41977, '2', '3', 'Агротекс Бело-красный  армированный нетканый укрывной материал 60-3 *5м', 853, 655.3, '', NULL, 0),
(9, 41758, '2', '3', 'Агротекс Белый армированный нетканый укрывной материал 60-3,0*5', 850, 653.5, '', NULL, 0),
(10, 41755, '2', '3', 'Агротекс Желто-черный двухслойный мульчирующий материал 80-1,6*5 м', 336, 258.07, '', NULL, 0),
(11, 42534, '2', '3', 'Агротекс Красно-желтый двухслойный укрывной материал 40-1,6-5м', 285, 219, '', NULL, 0),
(12, 48121, '3', '6', 'Алебастр 1кг (15шт)', 35, 26.2, '', NULL, 0),
(13, 48122, '3', '6', 'Алебастр 3кг (10шт)', 61, 46.7, '', NULL, 0),
(14, 62865, '2', '4', 'АМИНОЗОЛ АВГУСТ 5мл/200', 25, 18.8, '', NULL, 0),
(15, 40337, '4', '7', 'Аптечка \"Скорая помощь\"    ПЦ3756', 352, 270.4, '', NULL, 0),
(16, 40336, '4', '7', 'Аптечка \"Скорая помощь\"   ПЦ3749', 230, 177, '', NULL, 0),
(17, 19408, '2', '8', 'Бак 100л с крышкой оцинкованный', 1331, 1024, '', NULL, 0),
(18, 61194, '2', '9', 'Бак 105л пищевой с крышкой Белый мрамор (15)', 1237, 951.3, '', NULL, 0),
(19, 64021, '2', '9', 'Бак 120л с крышкой на колесах для мусора Зелёный (1) 122064', 2639, 2030, '', NULL, 0),
(20, 50137, '2', '9', 'Бак 150л пищевой с крышкой', 1642, 1262.3, '', NULL, 0),
(21, 28119, '2', '9', 'Бак 32л пищевой с крышкой', 458, 351.9, '', NULL, 0),
(22, 37001, '2', '8', 'Бак 32л с крышкой и краном оцинкованный', 668, 513.4, '', NULL, 0),
(23, 61143, '2', '9', 'Бак 32л, эм. р-2829 (сереголуб.)', 1647, 1267, '', NULL, 0),
(24, 62251, '2', '9', 'Бак 35л с крышкой белый мрамор Б-35', 637, 489.5, '', NULL, 0),
(25, 62936, '2', '9', 'Бак 40л Черный/Зеленый М2392 (1)', 704, 541.4, '', NULL, 0),
(26, 62937, '2', '9', 'Бак 40л Черный/синий М2392 (1)', 657, 505, '', NULL, 0),
(27, 27433, '2', '9', 'Бак 45л пищевой с крышкой (высота 45см)', 571, 438.9, '', NULL, 0),
(28, 49621, '2', '9', 'Бак 60,0л Зеленый М2393 (1)', 898, 690.8, '', NULL, 0),
(29, 41827, '2', '9', 'Бак 65л с крышкой', 835, 641.7, '', NULL, 0),
(30, 24518, '2', '8', 'Бак 70л с крышкой оцинкованный', 1156, 888.4, '', NULL, 0),
(31, 63908, '2', '8', 'Бак 75л оцинкованный овальный с краном', 1122, 863, '', NULL, 0),
(32, 50138, '2', '9', 'Бак 75л пищевой с крышкой', 963, 740.2, '', NULL, 0),
(33, 62067, '2', '9', 'Бак 90,0л Синий/Черный М2394 (1)', 1312, 1008.5, '', NULL, 0),
(34, 49623, '2', '9', 'Бак 90л Зеленый/черный М2394 (1)', 1412, 1086, '', NULL, 0),
(35, 63964, '2', '9', 'Бак 90л с крышкой для мусора Микс(5) 122062', 1352, 1040, '', NULL, 0),
(36, 60861, '1', '1', 'Бак для соления 13.0л (Базовый) М2405 (6)', 544, 418.2, '', NULL, 0),
(37, 60862, '1', '1', 'Бак для соления 25.0л (Базовый) М2406 (3)', 926, 711.8, '', NULL, 0),
(38, 38277, '1', '10', 'БАНКА \"ЛЮКС\"1,1л. д/сып.прод. с641  (20)', 77, 59, '', NULL, 0),
(39, 38278, '1', '10', 'БАНКА \"ЛЮКС\"1,7л. д/сып.прод. с642', 125, 95.6, '', NULL, 0),
(40, 38280, '1', '10', 'БАНКА \"СТАЙЛ\"1,3л. д/сып.прод. с644  (20)', 93, 71.3, '', NULL, 0),
(41, 38281, '1', '10', 'БАНКА \"СТАЙЛ\"2,2л. д/сып.прод. с645    (19)', 118, 90.8, '', NULL, 0),
(42, 38282, '1', '10', 'БАНКА \"СТАЙЛ\"4л. д/сып.прод. с646   (8)', 182, 139.8, '', NULL, 0),
(43, 14492, '1', '10', 'Банка д/сып. прод. \"Optima\"  2,4л  3612 (18)', 190, 145.6, '', NULL, 0),
(44, 14489, '1', '10', 'Банка д/сып. прод. \"Optima\" 0,8л  3610 (26)', 93, 71.5, '', NULL, 0),
(45, 14491, '1', '10', 'Банка д/сып. прод. \"Optima\" 1.6л  3611 (46)', 125, 95.7, '', NULL, 0),
(46, 8922, '1', '10', 'Банка д/сып. продуктов 0,6л кругл. с297 (36)', 51, 39, '', NULL, 0),
(47, 9192, '1', '10', 'Банка д/сып. продуктов 1,0л овал. с252 (32)', 79, 60.8, '', NULL, 0),
(48, 8924, '1', '10', 'Банка д/сып. продуктов 1,4л кругл. с262 (18)', 115, 88.3, '', NULL, 0),
(49, 14735, '1', '10', 'Банка д/сып. продуктов 1,5л овал. с294 (24)', 91, 69.7, '', NULL, 0),
(50, 14736, '1', '10', 'Банка д/сып. продуктов 2,0л овал. с293 (18)', 105, 80.6, '', NULL, 0),
(51, 432, '1', '10', 'Банка д/сып.продуктов 0,75л с ложкой с306 (50)', 63, 48.3, '', NULL, 0),
(52, 48922, '1', '10', 'Банка д/сып.продуктов 0,7л с ложкой \"ЛАВАНДА\" с30608 (50)', 90, 68.8, '', NULL, 0),
(53, 23024, '1', '10', 'Банка д/сыпучих продуктов 0,6 л квадрат. С266 (18)', 79, 60.1, '', NULL, 0),
(54, 23026, '1', '10', 'Банка д/сыпучих продуктов 1,2л квадрат. С267 (30)', 105, 80.7, '', NULL, 0),
(55, 12061, '1', '10', 'Банка д/хранения 0,22л С467', 29, 22, '', NULL, 0),
(56, 21171, '1', '10', 'Банка для сыпучих продуктов 0,75л оранж. К-0,75', 75, 57.8, '', NULL, 0),
(57, 20847, '1', '10', 'Банка для сыпучих продуктов 1,5л белый К-1', 96, 73.2, '', NULL, 0),
(58, 50795, '1', '11', 'Банка с завин. герметичной крышкой  Премиум 0,3л с43101 (30)', 43, 32.6, '', NULL, 0),
(59, 46220, '1', '11', 'Банка с завин. герметичной крышкой \"Премиум\" 0,5л 43201 (44)', 44, 33.6, '', NULL, 0),
(60, 50798, '1', '11', 'Банка с завин. герметичной крышкой Премиум 0,6л с43301 (32)', 45, 34.3, '', NULL, 0),
(61, 18053, '1', '11', 'Банка с завин. крышкой \"Твист\" 0,5л h=120мм с11389 (32)', 67, 51.5, '', NULL, 0),
(62, 47650, '1', '11', 'Банка с завин. крышкой \"Твист\" 0,75л 11391', 73, 55.2, '', NULL, 0),
(63, 47651, '1', '11', 'Банка с завин. крышкой \"Твист\" 1,2л 11390', 90, 68.9, '', NULL, 0),
(64, 17075, '1', '11', 'Банка с завин. крышкой 0,15л С466', 25, 18.5, '', NULL, 0),
(65, 50796, '1', '11', 'Банка с завин. крышкой 0,3л с431 (30)', 31, 23.8, '', NULL, 0),
(66, 50797, '1', '11', 'Банка с завин. крышкой 0,5л с432 (22)', 31, 24, '', NULL, 0),
(67, 50799, '1', '11', 'Банка с завин. крышкой 0,6л с433 (32)', 34, 25.4, '', NULL, 0),
(68, 26456, '1', '11', 'Банка с завин. крышкой 0,7л с441  (27)', 36, 27.2, '', NULL, 0),
(69, 40707, '1', '11', 'Банка с завин. крышкой 1,8л   11762   (24)', 97, 74.3, '', NULL, 0),
(70, 26454, '1', '11', 'Банка с завин. крышкой 1л с442 (30)', 44, 33.3, '', NULL, 0),
(71, 45554, '1', '11', 'Банка с завинч. кр. с декором \"Танго\" 0,4л 11805 (40)', 51, 39, '', NULL, 0),
(72, 37371, '1', '11', 'Банка с завинч. кр. с декором \"Танго\" 0,9л 11806 (33)', 79, 60.8, '', NULL, 0),
(73, 47649, '1', '11', 'Банка с завинч. крышкой 1л 11130', 87, 66.2, '', NULL, 0),
(74, 38685, '1', '11', 'Банка с завинчив. крышкой  с декором \"Танго\" 0,6л  11804', 59, 45, '', NULL, 0),
(75, 22346, '5', '12', 'Банкетка (440х330х516) с тканевым сиденье и ящиком (БП3/К) кофейный', 1190, 915, '', NULL, 0),
(76, 64440, '5', '12', 'Банкетка (440х330х516) с тканевым сиденьем и ящиком (БП3/ГЧ) горчичный', 1190, 915, '', NULL, 0),
(77, 62321, '5', '12', 'Банкетка (440х330х516) с тканевым сиденьем и ящиком (БП3/С) серый', 1190, 915, '', NULL, 0),
(78, 47909, '5', '12', 'Банкетка (500*330*450) винил медный антик  Б1', 896, 688.9, '', NULL, 0),
(79, 47910, '5', '12', 'Банкетка (500*330*450) винил серебро  Б1', 852, 655, '', NULL, 0),
(80, 29002, '5', '12', 'Банкетка (500*330*450) винил черный Б1', 852, 655, '', NULL, 0),
(81, 39941, '5', '12', 'Банкетка (500*330*450) сид. МДФ медный антик Б2', 1027, 790, '', NULL, 0),
(82, 47911, '5', '12', 'Банкетка (500*330*450) сид. МДФ серебро Б2', 976, 751, '', NULL, 0),
(83, 47912, '5', '12', 'Банкетка (500*330*450) сид. МДФ черный Б2', 976, 751, '', NULL, 0),
(84, 30415, '5', '12', 'Банкетка круглая, беж./антик', 821, 631.3, '', NULL, 0),
(85, 30416, '5', '12', 'Банкетка круглая, беж./черный', 821, 631.3, '', NULL, 0),
(86, 63001, '5', '12', 'Банкетка круглая, Белое серебро', 821, 631.3, '', NULL, 0),
(87, 63391, '5', '12', 'Банкетка с тканевым сидением и ящиком (БП2/С серебряный) ', 1187, 913, '', NULL, 0),
(88, 63392, '5', '12', 'Банкетка с тканевым сидением и ящиком (БП2/Ч черный) ', 1187, 913, '', NULL, 0),
(89, 33626, '1', '1', 'Безмен вертикальный 10кг пласт. 487-004', 39, 30, '', NULL, 0),
(90, 36924, '1', '1', 'Безмен вертикальный 12кг мет. 487-007', 86, 65.1, '', NULL, 0),
(91, 33627, '1', '1', 'Безмен вертикальный 25кг метал. 487-008', 151, 115.7, '', NULL, 0),
(92, 32999, '1', '1', 'Безмен круглый 10кг пласт.  487-006', 53, 40.4, '', NULL, 0),
(93, 32260, '6', '13', 'Бетономешалка электрическая \"МАСТЕР\" БМ-140Т', 13065, 10050, '', NULL, 0),
(94, 32259, '6', '13', 'Бетономешалка электрическая \"МАСТЕР\" БМ-160Т', 14521, 11170, '', NULL, 0),
(95, 31625, '6', '13', 'Бетономешалка электрическая \"МАСТЕР\" БМ-180ТП', 15210, 11700, '', NULL, 0),
(96, 31626, '6', '13', 'Бетономешалка электрическая \"МАСТЕР\" БМ-200ТП', 15795, 12150, '', NULL, 0),
(97, 61382, '6', '13', 'Бетономешалка электрическая \"МАСТЕР\" БМ-220ТП', 16601, 12770, '', NULL, 0),
(98, 61710, '6', '13', 'Бетономешалка электрическая \"МАСТЕР\" БМР-180', 12597, 9690, '', NULL, 0),
(99, 61383, '6', '13', 'Бетономешалка электрическая \"ТЕХПРОМ\" БМ-220Т', 12801, 9847, '', NULL, 0),
(100, 26966, '2', '9', 'Бидон 5л (Ижевск)', 121, 92.1, '', NULL, 0),
(101, 42320, '2', '14', 'Бинт садовый 0,08*10м Агротекс', 49, 37.3, '', NULL, 0),
(102, 41752, '2', '14', 'Бинт садовый 0,08*15м Агротекс', 64, 48.8, '', NULL, 0),
(103, 42321, '2', '14', 'Бинт садовый 0,12*10м Агротекс', 58, 44.9, '', NULL, 0),
(104, 60325, '2', '4', 'Биогумус для овощей Доброцвет 0,5л', 78, 59.4, '', NULL, 0),
(105, 49921, '2', '4', 'Биопрепарат Удачный д/туалетов 500мл /14', 179, 137.4, '', NULL, 0),
(106, 62458, '3', '15', 'Блок д/мелочей 114*142*34мм Прозрач. (100) М2950', 48, 36.1, '', NULL, 0),
(107, 62459, '3', '15', 'Блок д/мелочей 144*165*36мм Прозрач. (80) М2951', 73, 55.1, '', NULL, 0),
(108, 28594, '3', '15', 'Блок д/мелочей 14х13см  ПЦ3712 (68)', 61, 46.3, '', NULL, 0),
(109, 28582, '3', '15', 'Блок д/мелочей 17х16см  ПЦ3711', 90, 69, '', NULL, 0),
(110, 49624, '1', '16', 'Блюдо ДЕКО Гжель М1334 (30) снято с производства', 86, 65.3, '', NULL, 0),
(111, 49625, '1', '16', 'Блюдо ДЕКО Орхидея М1334 (30)', 77, 59, '', NULL, 0),
(112, 63419, '3', '15', 'Бокс \"World of Tanks\" 12\" серо-свинцовый BR5008СРСВИНЦ', 290, 222.9, '', NULL, 0),
(113, 63418, '3', '15', 'Бокс \"World of Tanks\" 9\" BR5007СРСВИНЦ', 166, 127.5, '', NULL, 0),
(114, 32569, '1', '17', 'Бокс для губок \"Флер\"  38500  (18)', 169, 129.7, '', NULL, 0),
(115, 44092, '4', '7', 'Бокс для мелочей 0,85л   с49200      (18)', 77, 58.7, '', NULL, 0),
(116, 10982, '2', '18', 'Бороздовичок БР (м)', 45, 34.7, '', NULL, 0),
(117, 62456, '2', '9', 'Бочка 20л. с крышкой с ручками Белый (1) М6002', 483, 371.1, '', NULL, 0),
(118, 27432, '2', '9', 'Бочка 30л', 481, 370, '', NULL, 0),
(119, 60101, '2', '9', 'Бочка 30л с широким горлом Радиан', 625, 480.7, '', NULL, 0),
(120, 27863, '2', '9', 'Бочка 40л (Ижевск)', 580, 445.3, '', NULL, 0),
(121, 60102, '2', '9', 'Бочка 40л с широким горлом Радиан', 672, 517, '', NULL, 0),
(122, 41174, '2', '9', 'Бочка 50л', 695, 534.2, '', NULL, 0),
(123, 27431, '2', '9', 'Бочка 50л с широким горлом Радиан', 723, 555.6, '', NULL, 0),
(124, 60386, '2', '9', 'Бочка 60л с широким горлом Радиан', 798, 613.5, '', NULL, 0),
(125, 62457, '2', '9', 'Бочка 60л. с крышкой с ручками Белый (1) М6004', 945, 726.9, '', NULL, 0),
(126, 63884, '2', '9', 'Бочка 80л с крышкой, с ручками Белый М6005', 1296, 996.8, '', NULL, 0),
(127, 50349, '2', '2', 'Брандспойт телескоп. алюминиевый 650/970мм', 456, 350.5, '', NULL, 0),
(128, 48459, '2', '2', 'Брандспойт телескоп. унив. 2,2м 10в1 алюм.', 526, 404.2, '', NULL, 0),
(129, 50348, '2', '2', 'Брандспойт телескоп. унив. 3м', 638, 490.5, '', NULL, 0),
(130, 50693, '4', '19', 'Брикет от грызунов АЛТ Грызунит восковой 50гр /80', 31, 23.1, '', NULL, 0),
(131, 32693, '3', '20', 'Брусок абраз. двустор. 150мм  /6\" 645-133', 50, 38.2, '', NULL, 0),
(132, 31398, '3', '20', 'Брусок абраз. двустор. 200мм  /8\" 645-125', 67, 51.2, '', NULL, 0),
(133, 31320, '3', '21', 'Брусок шлифовальный с зажимом 105х210  645-104', 166, 127.5, '', NULL, 0),
(134, 45785, '1', '22', 'Бумага для выпекания в ПП 8м  5216', 26, 19.1, '', NULL, 0),
(135, 20835, '1', '22', 'Бумага для выпечки 28см-5м КРЕПАК', 25, 18.8, '', NULL, 0),
(136, 61542, '1', '22', 'Бумага для выпечки Азур 0,29х6 9035', 39, 29.4, '', NULL, 0),
(137, 61547, '1', '22', 'Бумага для выпечки Азур 0,38х6 90225', 54, 41.1, '', NULL, 0),
(138, 50723, '1', '22', 'Бумага для выпечки ТМ HD 10м 45г/кв м 10844 (30)', 30, 22.9, '', NULL, 0),
(139, 60839, '1', '11', 'Бутербродница Базовый М1201 (24)', 52, 39.4, '', NULL, 0),
(140, 63965, '4', '23', 'Ваза д/ цветов под срез 3,7л\"ФЛОРА\" Белый D190мм h-37.5мм (5/25) 114035', 157, 120.1, '', NULL, 0),
(141, 64217, '4', '23', 'Ваза д/ цветов под срез 3,7л\"ФЛОРА\" Бронзовый D190мм h-37.5мм (5/25) 114035', 157, 120.1, '', NULL, 0),
(142, 63966, '4', '23', 'Ваза д/ цветов под срез 3,7л\"ФЛОРА\" Гранит D190мм h-37.5мм (5/25) 114035', 157, 120.1, '', NULL, 0),
(143, 63967, '4', '23', 'Ваза д/ цветов под срез 3,7л\"ФЛОРА\" Тёмно-коричневый D190мм h-37.5мм (5/25) 114035', 157, 120.1, '', NULL, 0),
(144, 64218, '4', '23', 'Ваза д/ цветов под срез 3,7л\"ФЛОРА\" Черный D190мм h-37.5мм (5/25) 114035', 157, 120.1, '', NULL, 0),
(145, 35703, '4', '23', 'Ваза д/цветов \"Модерн\" Д=112мм   40002  (18)', 126, 96.9, '', NULL, 0),
(146, 29114, '2', '24', 'Вазон на ножке большой  D=395  9,5л ING1451', 335, 257.9, '', NULL, 0),
(147, 48592, '1', '1', 'Вакуумная крышка КВК-100 цена за уп 5шт', 168, 129, '', NULL, 0),
(148, 48595, '1', '1', 'Вакуумная крышка КВК-38 цена за уп 5шт', 82, 63, '', NULL, 0),
(149, 48713, '1', '1', 'Вакуумная крышка КВК-82 цена за уп. 10шт', 220, 169, '', NULL, 0),
(150, 48593, '1', '1', 'Вакуумная крышка резьбовая КВК-82Р цена за уп. 5шт', 150, 115, '', NULL, 0),
(151, 48591, '1', '1', 'Вакуумный набор в блистерной уп. ВАКС 82Б (20)', 337, 259, '', NULL, 0),
(152, 48594, '1', '1', 'Вакуумный насос НВР-3 (100)', 155, 119, '', NULL, 0),
(153, 41410, '2', '8', 'Ванна 45л оцинкованная (4)', 563, 433, '', NULL, 0),
(154, 3283, '2', '8', 'Ванна 75л оцинкованная 74*52см (3)', 780, 600, '', NULL, 0),
(155, 12098, '7', '25', 'Ванночка дет. \"Жемчужинка\" 55л с карманом со сливом Бирюзовый LA2907БРЗ ', 736, 565.1, '', NULL, 0),
(156, 61537, '7', '25', 'Ванночка детская \"COOL\" со сливом Белый перламутровый LA4108БЛП', 595, 457.2, '', NULL, 0),
(157, 61538, '7', '25', 'Ванночка детская \"COOL\" со сливом Голубой LA4108ГЛП', 595, 457.2, '', NULL, 0),
(158, 61539, '7', '25', 'Ванночка детская \"COOL\" со сливом Розовый  LA4108РЗ', 595, 457.2, '', NULL, 0),
(159, 64284, '7', '25', 'Ванночка детская \"COOL\" со сливом Серо-сиреневый LA4108СРН', 595, 457.2, '', NULL, 0),
(160, 63415, '7', '25', 'Ванночка детская \"Start\" Голубой LA2103BL', 520, 399.2, '', NULL, 0),
(161, 64285, '7', '25', 'Ванночка детская \"Start\" Розовый LA2103SR', 520, 399.2, '', NULL, 0),
(162, 14488, '7', '25', 'Ванночка детская \"Ангел\" ПЦ4103', 529, 406.1, '', NULL, 0),
(163, 28577, '7', '25', 'Ванночка детская \"Ангел\" с термометром  ПЦ4102', 587, 451.3, '', NULL, 0),
(164, 26014, '7', '25', 'Ванночка детская \"Малыш\" с526 (6)', 598, 460, '', NULL, 0),
(165, 50754, '7', '25', 'Ванночка детская (Радиан)', 416, 319.5, '', NULL, 0),
(166, 60871, '7', '25', 'Ванночка детская ОКЕАНИК Малиновый прозрачный М2592 (1)', 565, 434.1, '', NULL, 0),
(167, 49630, '7', '25', 'Ванночка детская ОКЕАНИК Оранжевый прозрачный М2592 (1)', 532, 408.5, '', NULL, 0),
(168, 30328, '7', '25', 'Ванночка детская с13269', 572, 440, '', NULL, 0),
(169, 63755, '7', '25', 'Ванночка детская\"Буль-буль\"(слив+ковш)  (Радиан)', 481, 369.1, '', NULL, 0),
(170, 46572, '8', '26', 'Вантуз \"Мега с подставкой\" SV3945 (12)', 201, 154.5, '', NULL, 0),
(171, 14738, '8', '26', 'Вантуз малый с329 (32)', 82, 62.5, '', NULL, 0),
(172, 40703, '8', '26', 'Вантуз Премиум  с439  (р-р 130*130*230) (21)', 83, 63.8, '', NULL, 0),
(173, 40704, '8', '26', 'Вантуз Премиум  с449   h430мм    (15)', 195, 149.6, '', NULL, 0),
(174, 46486, '8', '26', 'Вантуз с деревянной ручкой 9711 (30)', 191, 147, '', NULL, 0),
(175, 49633, '8', '26', 'Вантуз Синий М2245 (15)', 52, 40, '', NULL, 0),
(176, 63203, '9', '27', 'Варежка из микрофибры, 20х14см 728-013', 85, 65, '', NULL, 0),
(177, 60133, '10', '28', 'Варежка-скребок СА-558', 101, 78, '', NULL, 0),
(178, 61179, '2', '29', 'Ведро 1,1л с крышкой полимерное глянец JETB 11 IML', 44, 33.9, '', NULL, 0),
(179, 50748, '2', '29', 'Ведро 10л \"Классика\" с крышкой, мерное SV4075 (32)', 187, 143.1, '', NULL, 0),
(180, 9198, '2', '29', 'Ведро 10л \"Находка\" мерное (10) С071', 168, 128.4, '', NULL, 0),
(181, 42799, '2', '29', 'Ведро 10л \"Омега\" Овощи ПЦ3609ОВЩ (10)', 224, 172, '', NULL, 0),
(182, 50746, '2', '29', 'Ведро 10л \"ОМЕГА\" ПЦ3603 (10)', 139, 106.2, '', NULL, 0),
(183, 29705, '2', '29', 'Ведро 10л (10) с077', 148, 114, '', NULL, 0),
(184, 27782, '2', '29', 'Ведро 10л для садово-огородных работ (СЛ)', 92, 71, '', NULL, 0),
(185, 17554, '2', '29', 'Ведро 10л для садово-огородных работ Сорт 2 (СЛ)', 67, 51.3, '', NULL, 0),
(186, 30332, '2', '29', 'Ведро 10л евро пищевое мерное без крышки (Радиан)', 126, 96.1, '', NULL, 0),
(187, 16835, '2', '29', 'Ведро 10л пищевое /СЛ/ (10)', 138, 105.2, '', NULL, 0),
(188, 60040, '2', '29', 'Ведро 12л \"Декор\" Кружева SV4103КРЖ (8)', 208, 159.7, '', NULL, 0),
(189, 50751, '2', '29', 'Ведро 12л \"Классика\" с крышкой, мерное SV4077 (18)', 214, 164.6, '', NULL, 0),
(190, 38889, '2', '29', 'Ведро 12л \"Ориджинал\" SV3958 (12)', 238, 182.3, '', NULL, 0),
(191, 63466, '2', '29', 'Ведро 12л (10) С074', 137, 105, '', NULL, 0),
(192, 7549, '9', '30', 'Ведро 12л GH004', 1618, 1244.8, '', NULL, 0),
(193, 28924, '2', '29', 'Ведро 12л евро пищевое (Р)', 144, 110.2, '', NULL, 0),
(194, 61042, '2', '29', 'Ведро 12л круглое кремовое 638', 147, 113, '', NULL, 0),
(195, 32749, '2', '29', 'Ведро 12л круглое со сливом SV 3919 (8)', 157, 120.4, '', NULL, 0),
(196, 63014, '2', '29', 'Ведро 12л МОП круглое \"Декор\" Классика (8) SV3974КЛАССИКА', 245, 188.2, '', NULL, 0),
(197, 60123, '2', '29', 'Ведро 12л огородное с носиком (10) с278', 169, 129.9, '', NULL, 0),
(198, 10731, '2', '29', 'Ведро 12л оцинкованное (10)', 159, 121.7, '', NULL, 0),
(199, 10624, '2', '29', 'Ведро 12л пищевое с крышкой (Радиан)', 183, 140.8, '', NULL, 0),
(200, 38678, '2', '29', 'Ведро 12л строительное 9921', 108, 82.6, '', NULL, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `main_group`
--

CREATE TABLE `main_group` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(150) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `main_group`
--

INSERT INTO `main_group` (`id`, `title`) VALUES
(1, 'Товары для кухни'),
(2, 'Сад и огород'),
(3, 'Инструменты'),
(4, 'Товары для дома'),
(5, 'Раскладушки, Комоды, Полки для Обуви'),
(6, 'Иструменты'),
(7, 'Санки, Ледянки, Детские товары'),
(8, 'Товары для ванной'),
(9, 'Для уборки'),
(10, 'Уход за автомобилем'),
(11, 'Вешалки для одежды'),
(12, 'Лестницы, Стремянки'),
(14, 'Все для пикника и загородного отдыха'),
(15, 'Гладильные доски'),
(20, 'Электротовары'),
(21, 'Сушилки'),
(22, 'Теплообменники');

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

CREATE TABLE `orders` (
  `id` int(10) UNSIGNED NOT NULL,
  `item_id` int(11) DEFAULT NULL,
  `quantity` int(11) DEFAULT NULL,
  `customers_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `sub_group`
--

CREATE TABLE `sub_group` (
  `id` int(10) UNSIGNED NOT NULL,
  `title` varchar(150) DEFAULT NULL,
  `maingroup_id` int(11) UNSIGNED DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `sub_group`
--

INSERT INTO `sub_group` (`id`, `title`, `maingroup_id`) VALUES
(1, 'Консервирование', 1),
(2, 'Инвентарь для полива', 2),
(3, 'Парники, пленка, укрывной материал', 2),
(4, 'Удобрения и биоактиваторы', 2),
(5, 'Защита растений от вредителей и сорняков', 2),
(6, 'ЛКМ, пены, герметики и прочее', 3),
(7, 'Ящики и коробки', 4),
(8, 'Оцинковка', 2),
(9, 'Тара (баки, бидоны и прочее)', 2),
(10, 'Емкость для сыпучих продуктов', 1),
(11, 'Контейнеры и емкости для холодильника и СВЧ', 1),
(12, 'Полки для обуви', 5),
(13, 'Электроинструмент', 6),
(14, 'Уход за растениями', 2),
(15, 'Ящики для инструментов и прочих мелочей', 3),
(16, 'Подносы и блюда', 1),
(17, 'Щетки и губки для посуды', 1),
(18, 'Ручной инструмент', 2),
(19, 'Средства защиты от насекомых и грызунов', 4),
(20, 'Прочее', 3),
(21, 'Терочные доски', 3),
(22, 'Товары для приготовления пищи', 1),
(23, 'Ваза для цветов', 4),
(24, 'Кашпо для цветов', 2),
(25, 'Для купания', 7),
(26, 'Вантузы', 8),
(27, 'Салфетки и губки для уборки', 9),
(28, 'Щетки, скребки, лопаты автомобильные', 10),
(29, 'Тазы и ведра', 2),
(30, 'Контейнеры для мусора', 9),
(31, 'Ведра для уборки', 9),
(32, 'Рукомойники, умывальники, ведра-туалет', 2),
(33, 'Щетка для пола', 9),
(34, 'Шнур, шпагат, веревка', 4),
(35, 'Почвогрунт и дренаж', 2),
(36, 'Настенные', 11),
(37, 'Настенные с полкой', 11),
(38, 'Напольные', 11),
(39, 'Гардеробные', 11),
(40, 'Вешалки-плечики', 11),
(41, 'Мебель для ванной комнаты', 8),
(42, 'Крючки настенные', 11),
(43, 'Надверные', 11),
(44, 'Лопаты, грабли, вилы, черенки', 2),
(45, 'Термометры', 4),
(46, 'Вышка-Тур', 12),
(47, 'Табуреты', 5),
(48, 'Молотки, кувалды, киянки, топоры, колуны', 3),
(49, 'Все для рассады', 2),
(50, 'Горшки и прочее', 7),
(51, 'Мочалки, массажеры, косметика для бани и сауны', 8),
(53, 'Печное литье', 2),
(54, 'Диспенсеры, дозаторы, держатели для мыла и бумаги', 8),
(56, 'Аксессуары для ванной комнаты', 8),
(57, 'Посуда для детей', 7),
(58, ' Аксессуары для детских санок', 7),
(59, 'Кемпинг, туризм и рыбалка', 14),
(60, 'Турецкие гладильные доски', 15),
(61, 'Гладильные доски \"Ника\"', 15),
(62, 'Разделочные доски', 1),
(63, 'null', 16),
(64, 'Ковши и дуршлаги', 1),
(65, 'Кружки и стаканы', 1),
(66, 'Миски и салатники', 1),
(67, 'Ерши для унитаза', 8),
(68, 'Костровое хозяйство', 14),
(69, 'Садовые ограждения', 2),
(70, 'Дверная и мебельная фурнитура', 4),
(71, 'Салфетки и губки для автомобиля', 10),
(72, 'Шторы для ванной (ПВХ) без колец', 8),
(73, 'Шторы для ванной из полиэтилена с кольцами', 8),
(74, 'Туристическая мебель', 14),
(75, 'Тачки садовые, строительные и комплектующие', 2),
(76, 'Кельмы, гладилки', 3),
(77, 'Кипятильники', 2),
(78, 'Кухонные принадлежности из силикона', 1),
(79, 'Кисти малярные', 3),
(80, 'Dekorama', 17),
(81, 'Клеенка столовая \"V-Line\" 140смх20м', 17),
(82, 'Клеёнка \"Колорит\" на нетканной основе (1,32*20м)', 17),
(83, 'GRACE ткань с ПВХ покрытием', 17),
(84, 'Клеенка ажурная Лейс (Lace)', 17),
(85, 'Элегия матовая 1,40*22м', 17),
(86, 'Аврора ПВХ 1,40*20м', 17),
(87, 'Клеенка столовая \"TREFL\" 1,4*20м', 17),
(88, 'Термостойкая клеенка', 17),
(89, 'Столовые приборы и аксессуары', 1),
(90, 'Коврики для ванной ворсовые\r\n', 8),
(91, 'Коврики из вспененного ПВХ (отрез)', 8),
(92, 'Коврики универсальные для дома', 4),
(93, 'Коврики и дорожки придверные', 4),
(94, 'Фотопечать - 1,3м', 18),
(95, '0,65*15 м', 18),
(96, '0.8*15 м', 18),
(97, '1,3*15 м', 18),
(98, 'LUX 0,65м', 18),
(99, 'LUX 0,80м', 18),
(100, 'LUX 1,3м', 18),
(101, 'V-LINE ILLUSION\" 0,65м*15м', 18),
(102, 'V-LINE ILLUSION\" 0,80м*15м', 18),
(103, 'V-LINE ILLUSION\" 1,30м*15м', 18),
(104, 'VELVET 0,65м', 18),
(105, 'VELVET 0,80м', 18),
(106, 'Фотопечать - 0,65м', 18),
(107, 'Фотопечать - 0,8м', 18),
(108, 'Коврики из ПВХ на присосках', 8),
(109, 'Решетки в раковину', 1),
(110, 'Декор для сада', 2),
(111, 'Карнизы для ванны', 8),
(112, 'Комоды', 5),
(113, 'Мебель для детской комнаты', 7),
(115, 'Швабры', 9),
(116, 'Наборы ковриков для ванной и туалета ворсовые', 8),
(117, 'Рейлинговые системы и комплектующие', 4),
(118, 'Шланги для полива и комплектующие', 2),
(119, 'Этажерки', 4),
(120, 'Ящики и контейнера для игрушек и мелочей', 7),
(121, 'Для домашних животных', 4),
(122, 'Изделия для сервировки стола', 1),
(123, 'Корзины для белья', 8),
(124, 'Корзинки для мелочей настольные', 4),
(125, 'Сумки, тележки, стяжки для груза', 2),
(126, 'Инвентарь для покоса (триммеры, леска, косы и пр.)', 2),
(127, 'Мангалы, решетки и походные котелки', 14),
(128, 'Терка, сито, овощечистка', 1),
(129, 'Крышки для унитаза', 8),
(130, 'Крышки для микроволновой печи и холодильника', 1),
(131, 'Крышки стекло и прочее', 1),
(132, 'Крепежные изделия', 3),
(133, 'Карнизы потолочные \"ЭКА\"', 19),
(134, 'Кувшины и фильтры для воды', 1),
(135, 'Рыхлители и картофелекопатели', 2),
(136, 'Инвентарь для уборки снега', 2),
(137, 'Ледянки и тюбинги', 7),
(138, 'Односекционные промышленные лестницы Sarayli', 12),
(139, 'Двухсекционные промышленные лестницы Sarayli', 12),
(140, 'Трехсекционные промышленные лестницы Sarayli', 12),
(141, 'Приставные лестницы \"Ника\"', 12),
(142, 'Стремянки двухсторонние (Ника)', 12),
(143, 'Лестницы-трансформеры', 12),
(144, 'Для одежды и ухода за ней', 4),
(145, 'Посудосушки и подставки для приборов', 1),
(146, 'Товары для дома', 4),
(147, 'Снегокаты, сноуборды и лыжи', 7),
(148, 'Аксессуары для детских санок', 7),
(149, 'Метла и щетка для улицы', 9),
(150, 'Мешки для мусора', 9),
(151, 'Пакеты для хранения и заморозки', 1),
(152, 'Вспомогательный малярный инструмент', 3),
(153, 'Мыльницы', 8),
(154, 'Набор ковриков для ванной и туалета ворсовые', 8),
(155, 'Все для праздника', 4),
(156, 'Совки и комплекты', 9),
(157, 'Посуда для выпечки', 1),
(158, 'Насадки МОП', 9),
(159, 'Ножи', 3),
(160, 'Секаторы и садовые ножницы', 2),
(161, 'Обогреватели', 20),
(162, 'Окномойки', 9),
(163, 'Для защиты', 3),
(165, 'Клеящиеся ленты, ленты специальные', 3),
(166, 'Подставки для цветов', 5),
(167, 'Подставки для СВЧ и TV', 1),
(168, 'Прищепки для белья', 21),
(169, 'Щетки бытовые', 9),
(170, 'Кровати раскладные', 5),
(171, 'Сидения для ванной', 8),
(172, 'Средства гигиены', 8),
(173, 'Санки', 7),
(174, 'Санки-коляски', 7),
(175, 'Скатерти', 17),
(176, 'Стремянки \" SARAYLI\" EUROPA', 12),
(177, 'Стремянки алюминиевые (Ника)', 12),
(178, 'Стремянки \"SARAYLI\" Aluminium', 12),
(179, 'Стремянки двухсторонние алюминиевые \" SARAYLI\"', 12),
(180, 'Стремянки бытовые', 12),
(181, 'Стремянка металлическая с широкой ступенью (Ника)', 12),
(182, 'Стремянки с опорой для рыхлых поверхностей', 12),
(183, 'Стремянка металлическая HAUSHALT', 12),
(184, 'Профильные лестницы-стремянки Sarayli', 12),
(185, 'Стремянки профильные металлические (Ника)', 12),
(186, 'Стулья', 5),
(187, 'Сушилки напольные', 21),
(188, 'Сушилки потолочные', 21),
(189, 'Сушилки на радиатор, на ванну', 21),
(190, 'Сушилки настенные', 21),
(191, 'Тесьма', 19),
(192, 'Салфетки для пола', 9),
(193, 'Френч-прессы и заварочные чайники', 1),
(194, 'Хлебницы', 1),
(195, 'Черенки для насадок и щеток', 9),
(196, 'Чехлы для гладильных досок', 15),
(197, 'Межкомнатные шторы', 4),
(198, 'Шторы для ванной тканевые', 8),
(199, 'Шторы для ванной (EVA - этиленвинилацетат)', 8),
(200, 'Щетки для пола', 9),
(201, 'Стамески, рубанки, щетки металлические', 3),
(202, 'Экраны для ванн', 8),
(203, 'Теплообменники \"Тактик\"', 22),
(204, 'Аксессуары для теплообменников ', 22);

-- --------------------------------------------------------

--
-- Структура таблицы `user`
--

CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `username` varchar(40) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `roles` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `user`
--

INSERT INTO `user` (`id`, `username`, `password`, `roles`) VALUES
(1, 'admin', '$2y$12$0B8kXC0KyXHOT99yDGxv1Opfo8toxXFAU2cG5lbg4FYZHBSZpmsQm', NULL);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `customers`
--
ALTER TABLE `customers`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `items`
--
ALTER TABLE `items`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `main_group`
--
ALTER TABLE `main_group`
  ADD PRIMARY KEY (`id`),
  ADD KEY `Индекс 1` (`id`);

--
-- Индексы таблицы `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK12323` (`customers_id`);

--
-- Индексы таблицы `sub_group`
--
ALTER TABLE `sub_group`
  ADD PRIMARY KEY (`id`),
  ADD KEY `Индекс 1` (`id`);

--
-- Индексы таблицы `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `customers`
--
ALTER TABLE `customers`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `items`
--
ALTER TABLE `items`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=201;

--
-- AUTO_INCREMENT для таблицы `main_group`
--
ALTER TABLE `main_group`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT для таблицы `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `sub_group`
--
ALTER TABLE `sub_group`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=205;

--
-- AUTO_INCREMENT для таблицы `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `orders`
--
ALTER TABLE `orders`
  ADD CONSTRAINT `FK12323` FOREIGN KEY (`customers_id`) REFERENCES `customers` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
